#+TITLE:  Programming in Scheme for SICP
#+AUTHOR: Howard X. Abrams
#+DATE:   2022-03-01

A literate programming file configuring Emacs.

#+begin_src emacs-lisp :exports none
  ;;; ha-programming-scheme --- Configuration for Scheme. -*- lexical-binding: t; -*-
  ;;
  ;; © 2022 Howard X. Abrams
  ;;   Licensed under a Creative Commons Attribution 4.0 International License.
  ;;   See http://creativecommons.org/licenses/by/4.0/
  ;;
  ;; Author: Howard X. Abrams <http://gitlab.com/howardabrams>
  ;; Maintainer: Howard X. Abrams
  ;; Created: March  1, 2022
  ;;
  ;; This file is not part of GNU Emacs.
  ;;
  ;; *NB:* Do not edit this file. Instead, edit the original literate file at:
  ;;            /Users/howard.abrams/other/hamacs/ha-programming-scheme.org
  ;;       And tangle the file to recreate this one.
  ;;
  ;;; Code:
  #+end_src
** Org Mode
:PROPERTIES:
:header-args:scheme:    :session *scheming* :results value replace
:END:
Do we need a Scheme work for Org Babel? According to [[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-scheme.html][this document]], we just need to make sure we add the =:session= variable to start the REPL.
#+begin_src emacs-lisp
  (use-package ob-scheme
    :straight (:type built-in)
    :config
    (add-to-list 'org-babel-load-languages '(scheme . t)))

#+end_src

Since the version of Scheme hasn't been updated with the deprecation, and subsequent removal of =org-babel-get-header=, we include it here:
#+begin_src emacs-lisp
  (defun org-babel-get-header (params key &optional others)
    (delq nil
          (mapcar
           (lambda (p) (when (funcall (if others #'not #'identity) (eq (car p) key)) p))
           params)))


#+end_src

Let’s test it out by defining a variable:
#+begin_src scheme
  (define a 42)
#+end_src

And simply using it:
#+begin_src scheme :var b=8
  (+ a b)
#+end_src

#+RESULTS:
: ;Value: 50

And what about Scheme-specific stuff needed for SICP?
#+begin_src scheme
  (inc 42)
#+end_src

** Try It Out
:PROPERTIES:
:HEADER-ARGS:racket: :session racketeering :results value replace :lang racket
:END:
Working for values?
#+begin_src racket
  (* 6 7)
#+end_src

#+RESULTS:
: 42

Working for output?
#+begin_src racket :results output replace
  (define str-1 "hello")
  (define str-2 "world")
  (define all (string-join (list str-1 str-2) ", "))
  (display (string-titlecase all))
#+end_src

#+RESULTS:
: Hello, World

The interface is horrendously slow, as the =:session= doesn’t seem to work, and starting up a Racket REPL takes a long time.

** SICP and Racket
:PROPERTIES:
:header-args:racket: :session *rsicp* :results value replace :lang sicp
:END:
If using [[https://docs.racket-lang.org/sicp-manual/SICP_Language.html][Racket for SICP]], install the SICP language:
#+begin_src sh
  raco pkg install --auto --update-deps sicp
#+end_src

We now can give it a =#lang sicp= (or better yet, use the =:lang= header) to define certain SICP-specify features:

Let’s try this now:
#+begin_src racket
(inc 42)
#+end_src

#+RESULTS:
: 43

